<?php
// libs/a/a.charset.php
// (c) Yuri Popoff, Nov 2003, popoff.donetsk.ua
// A set of functions to process charsets
header('Content-Type: text/html; charset=windows-1251');


echo charset_x_win('ЮЕМПЧЕЛ')."<br />";
echo charset_x_win('юемпчел')."<br />";
echo charset_x_win('человек')."<br />";
echo charset_x_win('ЧЕЛОВЕК')."<br />";
echo charset_x_win("С‡РµР»РѕРІРµРє")."<br />";
echo charset_x_win("Р§Р•Р›РћР’Р•Рљ")."<br />";

function _charset_count_bad($s)
{ //count "bad" symbols in russian, in windows-1251
  $r=0;
  for($i=0;$i<strlen($s);$i++)
  {
    switch($s[$i])
    {
      case '¸':
      case '¨':
      case '«':
      case '»':
        break;
      default:
        $c=ord($s[$i]);
        if($c>=0x80&&$c<0xc0||$c<32)
          $r++;
    }
  }
  return $r;
}

function _charset_count_chars($s)
{ //count "good" symbols in russian, in windows-1251
  $r=0;
  for($i=0;$i<strlen($s);$i++)
  {
    $c=ord($s[$i]);
    if($c>=0xc0)
      $r++;
  }
  return $r;
}

function _charset_count_pairs($s)
{ //count "bad" pairs of chars for a string in russian, in windows-1251
  $a=array(
    0 => 'úûü',
    1 => 'éïôý',
    2 => 'éôý',
    3 => 'æéïôõöùúûüýþ',
    4 => 'éôù',
    5 => 'úûü',
    6 => 'çéòôõøùúûýÿ',
    7 => 'éïôõù',
    8 => 'úûü',
    9 => 'àáæèéóùúûüýþÿ',
    10 => 'áãéïôõùúûüýþÿ',
    11 => 'éðöúý',
    12 => 'äæçéú',
    13 => 'éìïú',
    14 => 'úûü',
    15 => 'áâãäæçéõùúýþ',
    16 => 'éúý',
    17 => 'é',
    18 => 'æé',
    19 => 'úûü',
    20 => 'áâãäæçéêïõöøùúüýþÿ',
    21 => 'áæçéôõö÷ùúûüþÿ',
    22 => 'áãäæçéëíïðñòôõö÷øùúüýþÿ',
    23 => 'áãäæçéïñôõö÷ùúûýþÿ',
    24 => 'áãäæçéôõøùúûýÿ',
    25 => 'áâãäæçéêëìïñòôõö÷øùúûýþÿ',
    26 => 'àáâãäæçèéêëìíîïðñòóôõö÷øùúûüý',
    27 => 'àîôúûüýþ',
    28 => 'àéëðóõúûüý',
    29 => 'àáåæèîóö÷øùúûüýþ',
    30 => 'èîóôúûüýÿ',
    31 => 'àîóôúûüý'
    );
  $b=array(
    0  => 'àààáàâàãàäàåàæàçàèàéàêàëàíàîàñàòàóàôàõàöà÷àøàùàýàþàÿáãáìáòáõáöá÷áøáùáúáüáþáÿâáâæâõâúâþãçãêãòã÷ãÿäääõäýåàåáåãåååæåèåîåïåñåóåôåöåùåýåþåÿæáæâæëæïæðæöæ÷æþçççñçòçøçýçþèàèåèæèèèéèîèïèóèôèöèøèùèýèþèÿéïéðêçêìê÷êøëáëâëçëíëøëùìâìãìõì÷ìýìþíáíâíýîàîâîãîåîæîçîèîéîêîëîìîîîïîóîôîõîöîøîùîýîþîÿïìïöðçñãñäñæñçñúñýòáòãòäòçòïòøòùòúòýóàóáóâóæóèóéóîóóóôóõóöóùóþóÿôëôìõãõäõêõïõñõøõýöâöìöóöû÷â÷ì÷ð÷øøðøñø÷ùíùðùüýâýãýäýçýéýêýìýíýïýòýôýõýÿþàþáþâþãþäþåþæþçþéþëþìþíþïþðþõþöþøþþÿáÿãÿäÿåÿæÿçÿèÿéÿïÿðÿøÿùÿþÿÿ',
    1  => 'àààæàîàïàôàùàýáàáááâáãáäáæáçáêáëáìáíáñáòáóáõáöá÷áøáùáúáûáüáþáÿâáâââãâäâæâçâêâëâìâíâïâðâñâòâóâõâöâ÷âøâùâúâüâþâÿãàãáãâãããäãåãçãèãêãëãìãíãðãñãòãóã÷ãøãÿäáäâäãäääæäçäêäëäìäíäîäïäðäñäòäõäöä÷äøäúäûäüäýäþåàåáåïåóåôåýåÿæáæâæãæäæææêæëæìæíæîæïæðæñæöæ÷æüæþçáçâçãçäçåçæçççèçêçëçìçíçðçñçòçóçöç÷çøçúçûçüçýçþçÿèàèýêâêäêæêçêêêëêìêíêñêòêöê÷êøëáëâëãëäëæëçëêëëëìëíëïëñëòëôëõë÷ëøëùìáìâìãìêìëìììíìïìðìñìòìóìôìõìöì÷ìøìùìûìüìýìþíáíâíãíäíæíçíêíëíííðíñíòíôíõíöí÷íøíùíüíýîàîîîôîõðáðâðãðäðæðçðêðëðìðíðïðððñðòðôðõðöð÷ðøðùñáñâñãñäñæñçñìñíñïñðñññôñõñ÷ñøñùñúñûñüñýñþòàòáòâòãòäòçòèòêòëòìòíòïòðòñòòòóòôòõòöò÷òøòùòúòûòüòýòþóîóóóöóùóýõãõäõåõèõêõëõìõíõïõðõñõòõóõøõýöâöèöêöìöó÷â÷å÷ê÷ë÷ì÷í÷î÷ð÷ò÷ó÷ø÷üøâøêøëøìøíøîøïøðøñøòøóøöø÷øüøþùîùðùüúþûáûãûæûèûïûðûóûöûøûÿüáüâüãüäüæüçüêüìüíüîüïüñüòüôüöü÷üøüùþàþáþâþãþåþæþçþéþêþìþíþïþõþöþ÷þøþùþþÿáÿâÿãÿäÿåÿæÿèÿéÿêÿíÿðÿñÿõÿöÿ÷ÿøÿþÿÿ',
    2  => 'àààîàóàôàùàýáàáááâáãáäáæáçáêáìáíáñáòáõáöá÷áøáùáúáûáüáþáÿâáâââãâäâæâçâêâëâìâíâïâòâóâõâöâ÷âøâùâúâüâþãàãáãâãããäãåãçãèãêãìãíãñãòã÷ãøãÿäáäãäääæäçäêäëäìäíäïäñäòäõäöä÷äøäúäüäýäþäÿåàåèåóåôåýæàæáæâæãæäæåæææêæëæìæíæîæïæðæñæóæöæ÷æüæþçåçæçççêçñçòçóçöç÷çøçüçýçþèóèôèýêâêäêæêçêêêìêñêòêöê÷êøëáëâëãëäëæëçëêëëëìëíëïëñëòëóëôëõë÷ëøëùëûìáìâìãìêìëìììíìïìðìñìòìóìôìõìöì÷ìøìùìüìýìþíáíâíãíäíæíçíêíëíííðíñíòíôíõíöí÷íøíùíüíýîàîôîýïêïìïíïïïñïòïôïöï÷ïøïûïüïÿðáðâðãðäðæðçðêðëðìðíðïðððñðòðôðõðöð÷ðøðùðüðþñáñâñãñäñæñçñèñíñðñññôñöñ÷ñøñùñúñüñýòáòâòãòäòçòêòëòìòíòïòñòòòóòôòõòöò÷òøòùòúòüòýòþóáóâóæóèóîóïóóóôóöóýõàõâõãõäõåõèõêõëõìõíõïõðõñõòõóõøõýöâöèöêöì÷â÷ê÷ë÷ì÷í÷ð÷ò÷ø÷üøâøêøëøìøíøïøðøñøòøöø÷øüøþùàùåùíùîùðùóùüúþúÿûùüáüâüãüäüæüçüêüìüíüîüïüôüöü÷üøüùþàþáþâþãþäþåþæþçþéþêþëþìþíþïþðþñþòþõþöþ÷þøþùþþÿáÿâÿãÿäÿåÿèÿéÿïÿðÿöÿ÷ÿøÿþÿÿ',
    3  => 'àààêàîàôàøàýáááâáãáäáæáçáèáêáëáìáíáîáðáñáòáóáõáöá÷áøáùáúáûáüáþáÿâáâââãâäâæâçâêâëâìâíâïâðâñâòâóâõâöâ÷âøâùâúâûâüâþâÿãàãáãâãããäãçãêãëãìãíãîãðãñãòãóã÷ãøãÿäáäâäãäääæäçäèäêäëäìäíäïäðäñäòäóäõäöä÷äøäúäûäüäýäþäÿåàåâåãåæåçåïåóåõåöå÷åøåùåýçáçâçãçäçåçæçççèçêçëçìçíçîçðçñçòçóçöç÷çøçúçûçüçýçþçÿèæèóèôèöèùèýêâêäêåêæêçêêêëêìêíêðêñêòêöê÷êøëáëâëãëäëæëçëêëëëìëíëïëñëòëôëõë÷ëøëùëüìáìâìãìèìêìëìììíìïìðìñìòìôìõìöì÷ìøìùìüìýìþìÿíáíâíãíäíæíçíêíëíííðíñíòíôíõíöí÷íøíùíûíüíýîþðáðâðãðäðæðçðêðëðìðïðððñðòðôðõðöð÷ðøðùðüñàñáñâñãñäñåñæñçñèñëñìñíñïñðñññóñôñõñöñ÷ñøñùñúñûñüñýñþòàòáòâòãòäòçòêòëòìòíòïòðòñòòòôòõòöò÷òøòùòúòûòüòýóâóãóçóèóéóêóîóïóóóôóöóýóÿ÷â÷ê÷ë÷ì÷í÷î÷ð÷ò÷ø÷üøàøâøêøëøìøíøîøïøðøñøóøöø÷øüøþÿáÿâÿãÿåÿæÿçÿèÿéÿêÿëÿíÿïÿðÿñÿòÿõÿöÿ÷ÿøÿùÿþÿÿ',
    4  => 'àààçàóàùàýáááâáãáäáæáçáêáëáìáíáñáòáóáõáöá÷áøáùáúáûáüáþáÿâáâââãâäâæâìâíâïâðâñâòâõâöâ÷âøâùâúâüâþâÿãáãâãããäãåãçãêãìãíãñãòãóã÷ãøãÿäáäãäääæäçäêäëäìäíäïäðäñäòäõäöä÷äøäúäûäüäýäþäÿåóåõåùåýæáæâæãæäæææêæëæìæíæïæðæñæöæ÷æüæþçáçâçãçäçæçççêçëçìçðçñçòçöç÷çøçúçûçüçþçÿèãèõèýêâêäêæêçêêêìêíêñêòêöê÷êøëáëâëãëäëæëçëêëëëìëíëïëñëòëôëõë÷ëøëùëüëþìáìâìãìêìëìììïìðìñìòìôìõìöì÷ìøìùìüìýìþìÿíáíâíãíäíæíçíëíííðíñíôíõíöí÷íøíùíüíýîàîôîýîþîÿïåïêïìïíïïïñïòïôïöï÷ïøïûïüïÿðáðâðãðäðæðçðêðëðìðíðïðððòðôðõðöð÷ðøðùðüñáñãñäñæñçñíñðñññôñõñöñøñùñúñûñüñýñþñÿòáòãòäòçòêòëòìòíòïòñòòòóòôòõòöò÷òøòùòúòûòüòýòþóäóçóôõãõäõèõêõëõìõíõïõðõñõòõóõøõýöâöèöêöì÷â÷ê÷ë÷ì÷í÷î÷ð÷ò÷ø÷üøâøêøëøìøíøîøïøðøñøöø÷øüøþûçûèûóûöûÿüâüãüäüæüçüíüîüïüñüôüöü÷üøüùýãýäýçýéýëýìýïýñýòýôýõýÿþàþáþâþãþäþåþëþìþñþòþõþöþ÷þùþþÿáÿâÿåÿæÿçÿêÿëÿïÿðÿöÿøÿþÿÿ',
    5  => 'àààåàæàçàèàéàîàïàðàñàóàôàõàöà÷àøàùàýàþàÿáááâáãáäáæáçáõáöá÷áøáùáúâáâââãâæâïâõâùâúâþãáãâãããçãòãøäãäõäöäþåàåáåãåäåååæåèåëåíåîåóåôåùåýåþåÿæáæâæææìæ÷æþçñçöçøçúçýèàèáèäèåèæèèèéèîèðèóèôèöè÷èøèùèýèþèÿéâéîéõêæêçêêêìê÷ëäëæëçëïëôëõëøëùìâìðìôìõìøìýìþíæíëíôíýîàîåîèîéîóî÷îøîþîÿïìïïïôðùñãñæñçñùñúñýñþòãòäòçòïòôòöòùòúòýòþóàóèóéóîóóóôóöóøóùóýôìôíôñô÷ôûõãõêõðõòõøöâöìöó÷â÷ì÷ð÷øøâøìøïøðøöø÷øþùíùîýâýãýäýçýéýëýìýíýïýðýñýõýÿþàþáþâþãþäþåþæþçþéþêþëþìþíþïþðþõþöþ÷þøþþÿáÿãÿåÿæÿçÿèÿéÿêÿïÿöÿ÷ÿøÿùÿþÿÿ',
    6  => 'àààáàçàèàîàïàóàôàöàøàýáááâáãáäáæáçáêáëáìáíáðáñáòáõáöá÷áøáùáúáüáþáÿâáâââãâäâåâæâçâèâêâëâìâíâîâïâðâñâòâóâõâöâ÷âøâùâúâûâüâþâÿãáãâãããäãåãçãêãìãíãîãðãñãòã÷ãøãÿäáäâäãäääæäçäêäìäíäïäðäñäòäõäöä÷äøäúäýåàåæåèåîåóåõåýåþåÿæáæâæãæäæææêæëæìæíæîæïæðæñæóæöæ÷æüæþèàèáèóèôèýêâêäêæêçêêêëêìêíêðêñêòêöê÷êøëáëâëãëäëåëæëçëêëëëìëíëîëïëñëòëóëôëõë÷ëøëùëûëüëþëÿìàìáìâìãìêìëìììíìïìðìñìòìôìõìöì÷ìøìùìûìüìýìþìÿíáíâíãíäíæíçíêíëíííðíñíòíôíõíöí÷íøíùíüíýîàîáîâîäîæîèîëîîîïîòîóîôîõîöîùîýîþîÿïàïåïèïêïìïíïîïïïðïñïòïóïôïöï÷ïøïûïüïÿðáðâðãðäðæðçðêðëðìðíðïðððñðòðôðõðöð÷ðøðùðûðüðþðÿñàñáñâñãñäñåñæñçñèñëñìñíñîñïñðñññòñóñôñõñöñ÷ñøñùñúñûñüñýñþñÿóáóâóãóäóçóìóîóïóóóôóöóøóýöâöåöèöêöìöî÷à÷â÷å÷ê÷ë÷ì÷í÷î÷ð÷ò÷ó÷ø÷üüáüâüãüäüæüçüêüìüíüîüïüôüöü÷üøüùþàþáþâþãþäþåþæþçþéþêþìþíþïþñþòþõþöþ÷þøþùþþ',
    7  => 'àýáááâáãáäáæáçáêáìáíáñáòáõáöá÷áøáùáúáüáþáÿâáâââãâäâæâçâìâïâñâòâõâöâ÷âøâùâúâüâþãáãâãããäãçãêãìãñãòã÷ãøãÿäáäãäääæäçäëäìäïäñäòäõäöä÷äøäúäýäþåàåãåäåæåçåîåïåñåóåõå÷åùåýæáæâæãæäæææêæëæìæíæîæïæðæñæöæ÷æüæþçáçãçäçåçæçççèçêçëçìçîçñçòçóçöç÷çøçúçûçüçýçþçÿèáèçèïèôèõèùèýêâêäêæêçêêêëêìêíêðêñêòêöê÷êøëáëâëãëäëæëçëêëëëìëíëïëñëòëôëõë÷ëøëùëüìáìâìãìêìëìììðìñìòìôìõìöì÷ìøìùìüìýìþíáíâíãíäíæíçíêíëíííðíñíòíôíõíöí÷íøíùíýîàîæîèîóîôîöîýîþîÿðáðâðãðäðæðçðêðëðìðíðïðððñðòðôðõðöð÷ðøðùðüðþñàñáñâñãñäñåñæñçñèñëñìñíñîñïñðñññòñóñôñõñöñ÷ñøñùñúñûñüñýñþñÿòàòáòâòãòäòåòçòêòëòìòíòïòðòñòòòóòôòõòöò÷òøòùòúòûòýòþòÿóâóãóæóîóóóôóöóøóýöâöåöèöêöì÷à÷â÷ê÷ë÷ì÷í÷î÷ð÷ò÷ø÷üøàøâøåøêøëøìøíøîøïøðøñøòøóøöø÷øüøþûäûæûèûëûïûòûóûøûÿüâüãüäüæüçüèüêüíüîüïüñüôüöü÷üøüùýâýãýäýçýéýêýëýìýïýðýñýòýôýõýÿþàþáþâþãþäþåþæþçþéþêþëþíþïþðþñþòþõþöþ÷þøþùþþÿãÿäÿæÿçÿêÿïÿðÿñÿõÿöÿøÿþÿÿ',
    8  => 'àààåàæàèàéàîàóàõà÷àùàýàþáâáãáæáçáìáòáõáöá÷áùáúáÿâáâââãâäâæâçâìâïâòâùâúâþãáãâãããêãñã÷ãÿäáäãäääëäïäõä÷äøäúäüäýåàåáåååæåèåêåîåïåóåôå÷åøåùåýåþåÿæáæâæãæææëæìæïæðæöæ÷æüæþçççòçöçüçýçþèàèáèâèãèäèåèæèçèèèéèêèëèíèîèïèòèóèôèõèöè÷èøèùèýèþèÿéâéãéäéåéçéêéëéìéîéðéôéõé÷éøêäêæêçëáëãëæëçëìëíëïëòëôëõë÷ëøëùìðìòìõìøìùìüìýìþíëíðíøíùíýîåîæîèîéîîîóîôîöî÷îøîùîþîÿïìïôïöï÷ïüðãðçðôðõðöðùðüñáñãñæñçñðñôñùñúñýòáòãòäòçòïòôòõòøòùòúòþóàóáóâóåóæóçóèóéóîóðóóóôóõóöóøóùóýóþóÿôëôíô÷õãõäõêõìõòõøõýöâöì÷â÷ë÷ì÷ð÷øøâøïøðøñøòøöø÷øþùîùüýâýãýäýçýéýêýëýìýíýïýðýñýôýõýÿþàþáþâþãþäþåþæþçþéþêþìþðþñþõþöþ÷þøþþÿáÿãÿäÿèÿéÿêÿðÿñÿöÿ÷ÿøÿù',
    9  => 'âáâââãâäâåâæâçâèâêâëâìâíâïâðâñâòâóâõâöâ÷âøâùâúâûâüâþâÿãáãâãããäãåãçãèãêãëãìãíãîãðãñãòãóã÷ãøãÿäáäâäãäääçäêäëäìäíäïäðäñäõäöä÷äøäúäûäüäýäþåàåáåâåãåäåååæåçåèåéåêåìåîåïåñåòåóåôåõåöå÷åøåùåýåþåÿçáçâçãçäçæçççèçêçëçìçíçîçðçñçòçóçöç÷çøçúçûçüçýçþçÿêâêäêæêçêêêìêíêðêòêöê÷êøëáëâëãëäëæëêëëëìëíëïëñëòëôëõë÷ëøëùëüëþëÿìáìâìãìêìììíìïìðìòìôìõìöì÷ìøìùìüìýìþìÿíáíâíãíäíæíçíêíëíííðíñíòíôíõíöí÷íùíüíýîàîáîåîæîèîéîëîìîîîïîñîóîôîõîöî÷îøîùîýîþîÿïàïèïêïëïìïíïîïïïðïñïòïóïöï÷ïøïûïüïÿðàðáðâðãðäðåðæðçðèðêðëðìðíðïðððñðòðóðôðõðöð÷ðøðùðûðüðþðÿñâñãñäñåñæñçñëñíñïñðñññôñõñöñ÷ñøñùñúñüñýñþòáòâòãòäòçòêòëòìòíòïòòòôòõòöò÷òøòùòúòûòüòýòþòÿôëôìôíôðôñôòôôô÷ôûõâõãõäõåõèõêõëõìõíõîõïõðõñõòõóõøõýöâöèöêöì÷â÷å÷ê÷ë÷ì÷í÷î÷ð÷ò÷ó÷ø÷üøâøêøëøìøíøîøïøðøñøòøöø÷øüøþ',
    10 => 'àààùàýâáâââãâäâæâçâêâëâìâíâïâðâñâòâõâöâ÷âøâùâúâüâþâÿäàäáäâäãäääåäæäçäèäêäëäìäíäïäðäñäòäóäõäöä÷äøäúäûäüäýäþäÿåáåãåæåèåîåóåôåõåöå÷åøåùåýåþåÿæàæáæâæãæäæææèæêæëæìæíæîæïæðæñæóæöæ÷æüæþçáçâçãçäçæçççêçëçìçíçðçñçòçóçöç÷çøçúçûçüçýçþçÿèãèæèöèùèýèþêâêäêæêçêêêëêìêíêðêñêòêöê÷êøëáëâëãëäëæëçëêëëëìëíëïëñëòëôëõë÷ëøëùìáìâìãìèìêìëìììíìîìïìðìñìòìóìôìõìöì÷ìøìùìûìüìýìþìÿíáíâíãíäíæíçíêíëíííðíñíòíôíõíöí÷íøíùíüíýíþîàîöðáðâðãðäðæðçðêðëðìðíðïðððñðòðôðõðöð÷ðùðüñáñäñæñçñëñìñðñññõñ÷ñùñúñüñýñþòáòâòãòäòçòêòëòìòïòñòòòôòõòöò÷òøòùòúòüòýòþóàóãóæóéóîóôóöóýöàöâöêöìöîöóöû÷à÷â÷è÷ê÷ë÷ì÷í÷î÷ð÷ò÷ó÷ø÷üøâøêøëøìøíøîøïøðøñøòøöø÷øüøþ',
    11 => 'àààîàôàýáááâáãáäáæáçáêáëáìáñáòáõá÷áøáùáúáüáþáÿâáâââãâäâæâçâìâïâðâòâóâõâöâ÷âøâùâúâûâüâþâÿãáãâãããäãçãêãëãìãíãñãòã÷ãøãÿäáäâäãäääæäçäêäëäìäïäðäòäõäöä÷äøäúäüäýäÿåàæáæâæãæäæææêæëæìæîæïæðæñæóæöæ÷æüæþçáçâçãçäçæçççèçìçîçðçñçöç÷çøçúçûçüçýçþçÿèóèýêäêæêçêêêìêñêòêöê÷êøëáëâëãëäëæëçëêëëëìëíëïëòëôëõë÷ëøëùìáìâìãìêìëìììíìïìðìòìóìôìõìöì÷ìøìùìüìýìþìÿíáíâíãíäíæíçíêíëíííðíñíòíôíõí÷íøíùíüíýíþîýîþïêïëïìïíïïïðïñïòïôïöï÷ïøïüñáñâñãñäñæñçñëñìñíñïñðñññôñõñöñ÷ñøñùñúñûñüñýñþòáòâòãòäòçòèòêòëòìòíòïòðòñòòòôòõòöò÷òøòùòúòüòýòþòÿóùôèôëôìôíôîôðôñôòôóôôô÷ôûõàõãõäõåõêõëõìõíõïõðõñõòõóõøõý÷â÷ë÷ì÷ð÷ò÷øøàøâøèøêøëøìøíøîøïøðøñøòøóøöø÷øüøþùíùîùðùóùüûãûäûçûèûðûóûöûÿþàþãþåþéÿáÿè',
    12 => 'àààáàîàïàóàùáááâáãáäáæáçáêáìáíáñáòáõáöá÷áøáùáúáüáþáÿâáâââãâåâæâçâèâêâëâìâíâïâðâñâòâóâõâöâ÷âøâùâúâûâüâþâÿãàãáãâãããäãåãçãèãêãìãîãðãñãòãóã÷ãøãÿåàåïåóåýèàèáèæèùèýêâêäêæêçêêêëêìêðêñêòêöê÷êøëáëâëãëäëæëçëêëëëìëîëïëñëòëóëôëõë÷ëøëùëûëüìáìâìãìêìëìïìðìñìòìôìõìöì÷ìøìùìüìýìþìÿíáíâíãíäíæíçíêíëíííðíñíòíôíõíöí÷íøíùíüíýîàïêïìïíïïïñïôïöï÷ïÿðáðâðãðäðæðçðêðëðìðíðîðïðððñðòðôðõðöð÷ðøðùðûðüðþðÿñáñâñãñäñæñçñëñìñíñïñðñññôñõñöñ÷ñøñùñúñûñýñþòàòáòâòãòäòçòêòëòìòíòîòïòðòñòòòóòôòõòöò÷òøòùòúòûòüòýòþòÿóáóâóåóèóéóîóóóöóýóÿôëôìôíôðôñôòôôô÷ôûõàõâõãõäõåõèõêõëõìõíõïõðõñõòõóõøõýöâöèöêöìöî÷â÷ê÷ë÷ì÷í÷î÷ð÷ò÷ø÷üøàøâøêøëøìøíøîøïøðøñøòøóøöø÷øüøþùàùíùîùðùóùüûáûäûæûçûèûïûðûóûöûùûÿüáüâüãüæüçüêüìüíüîüïüôüöü÷üøüùýâýãýäýçýéýêýëýìýïýñýòýôýõýÿþàþáþâþãþäþåþæþçþéþêþìþïþðþñþòþõþöþ÷þøþùþþÿáÿäÿåÿæÿçÿéÿïÿðÿõÿöÿþÿÿ',
    13 => 'àààôàýáááâáãáäáæáçáèáêáëáìáíáîáðáñáòáõáöá÷áøáùáúáûáüáþáÿâáâââãâäâæâçâêâëâìâíâïâðâñâòâõâöâ÷âøâùâúâûâüâþâÿãáãããçãêãìãíã÷ãøãÿäáäâäãäääçäêäïä÷äúäüäýäÿåùæáæâæãæäæææêæëæìæíæîæïæðæñæöæ÷æüæþçáçâçãçäçæçççêçëçìçíçðçñçòçöç÷çøçúçüçýçþçÿèóèýêäêæêçêêêìêñê÷êøëàëáëâëãëäëåëæëçëêëëëìëíëîëïëñëòëóëôëõë÷ëøëùëûëüëþëÿíáíâíãíäíæíçíêíëíííðíñíôíõíöí÷íøíùíüíýîùðáðâðãðäðæðçðêðëðìðíðïðððñðòðóðôðõðöð÷ðøðùðûðüðþðÿñãñäñæñçñðñõñ÷ñøñùñúñüñýñþñÿòáòâòäòçòìòïòòòôòõòöò÷òøòùòúòüòýóáóãóçóèóîóïóóóôóõóöóýôìôíôñôòôôô÷ôûõàõâõãõäõèõêõëõìõíõïõñõòõóõøõýöâöêöì÷â÷ê÷ë÷ì÷í÷ð÷ò÷ø÷üøâøåøêøëøìøíøîøïøðøñøóøöø÷øüøþùàùåùíùîùðùóùüûáûãûäûæûçûèûêûñûóûöûùûÿüáüâüäüçüìüíüïüôüöü÷üùýâýãýäýçýéýêýëýìýíýðýñýòýôýõýÿþáþâþãþåþæþçþéþêþëþìþíþðþöÿáÿäÿïÿðÿö',
    14 => 'àààáàâàãàäàåàæàèàéàëàìàîàóàôàõàöà÷àøàùàýàþàÿáöáþâäâæâõâúâþãâãããçãêãñã÷ãøãÿäýäþåàåáåååèåðåóåôåùåýåÿæáæâæëæïæðæñæ÷æþçñçòçöç÷çøçúçýçþèàèáèåèæèèèéèîèïèóèôèýèþèÿéâéãéåéçéïéðéôéõéøêäêæêìêöê÷ëôìâìãìõìøìùìýìþíõíøíýîàîâîãîåîæîçîèîéîëîìîóîôîøîýîþîÿïìïôïøñãñçñùñýòýòþóàóåóæóèóéóîóðóóóôóöóøóùóþóÿôìôíôòô÷õãõäõêõïõñõýöóöû÷ì÷ð÷øøðøñøöø÷ùîýäýéýïýñýõýÿþàþáþâþãþæþéþêþëþìþíþïþðþõþöþ÷þøÿãÿåÿèÿïÿöÿ÷ÿøÿþÿÿ',
    15 => 'àààîàýåàåáåèåìåóåôåýåÿèáèóèôèýêâêäêæêçêêêëêìêíêðêñêòêöê÷êøëáëâëãëäëæëçëêëëëìëíëïëñëòëôëõë÷ëøëùìàìáìâìãìåìêìëìììíìîìïìðìñìòìóìôìõìöì÷ìøìùìûìüìýìþìÿíáíâíãíäíæíçíêíëíííðíñíòíôíõíöí÷íøíùíüíýíþîàïìïïïðïñïòïôïöï÷ïøïüïÿðáðâðãðäðæðçðêðëðìðíðïðððñðòðôðõðöð÷ðøðùðüðþñáñâñãñäñæñçñëñìñíñïñðñññôñõñöñ÷ñøñùñúñüñýñþñÿòáòâòãòäòçòêòëòìòíòïòðòñòòòôòõòöò÷òøòùòúòüòýòþòÿóâóåóæóèóéóìóîóóóôóöóýóÿôåôëôìôíôîôñôòôóôôô÷ôûöàöâöåöêöìöî÷â÷ê÷ë÷ì÷í÷î÷ð÷ò÷ó÷ø÷üøàøâøêøëøìøíøîøïøðøñøòøöø÷øüøþûáûäûçûèûêûíûïûñûóûöû÷ûÿüáüâüãüäüæüçüèüêüìüíüîüïüñüòüôüöü÷üøüùÿáÿâÿãÿäÿåÿæÿçÿèÿéÿêÿìÿíÿïÿðÿöÿ÷ÿøÿþÿÿ',
    16 => 'àýáááâáãáäáæáçáêáìáòáõáöá÷áøáùáúáûáüáÿâáâââãâäâæâçâêâëâìâïâðâñâòâõâöâ÷âøâùâúãáãâãããäãçãêãìãòã÷ãÿäáäâäãäääçäêäëäïäðäòäõä÷äøäúäüäýåýæáæâæãæææëæìæîæïæðæñæ÷æüæþçáçâçãçäçæçççìçðçñçòçóçöç÷çøçúçûçüçýçþçÿèýêäêæêçêêêìêðêöê÷êøëáëâëãëäëæëêëëëìëíëïëñëòëôëõë÷ëøëùëþìáìâìãìêìììíìïìðìñìòìôìõìöìøìùìüìýìþíâíãíäíæíçíêíëíííðíòíôíõíöí÷íøíùíüíýïêïìïïïñïòïôïöï÷ïøïüðáðâðãðäðæðçðêðëðìðíðïðððñðòðôðõðöð÷ðøðùðûðüðþðÿñáñâñãñäñæñçñëñìñíñðñññôñõñöñ÷ñøñùñúñüñýñþòáòãòäòïòòòõòöò÷òøòùòúòýòþóâóîóóóöóýôëôìôðôñôòôóôôô÷ôûõâõãõëõðõòõøöâöêöì÷â÷ê÷ì÷í÷î÷ð÷ò÷ø÷üøâøëøìøïøñøòøöø÷øüøþùàùíùîùðùóùüûèûðûóûÿüâüäüæüçüíüîüïüôüöü÷üøüùþàþáþâþäþåþæþéþïþðþöþþÿèÿðÿö',
    17 => 'àààçàèàîàùáááâáãáäáæáçáêáìáíáñáòáóáõáöá÷áøáùáúáüáÿâáâââãâäâæâçâêâëâìâíâïâñâòâõâöâ÷âøâùâúâüâþãàãáãâãããäãçãêãìãñãòã÷ãøãÿäáäãäääæäçäêäëäìäíäïäñäòäõäöä÷äøäúäûäüäýäþäÿåæåôåýæáæâæãæäæææêæëæìæíæîæïæðæñæóæöæ÷æüæþçáçâçãçäçåçæçççèçêçëçìçíçîçðçñçòçóçöç÷çøçúçûçüçýçþçÿèóèùèýêäêæêçêêêìêòêöê÷êøëáëâëãëäëæëçëêëëëìëíëïëñëòëôëõë÷ëøëùìáìâìãìêìëìììíìïìòìôìõìöì÷ìøìùìüìýìþíáíâíäíæíçíêíëíííðíñíòíôíõíöí÷íøíùíüíýîàîýîÿïêïìïíïïïñïòïôïöï÷ïøïüðáðâðãðäðæðçðêðëðìðíðïðððñðòðôðõðöð÷ðøðùðüðþðÿñáñãñäñæñçñññôñõñöñøñùñúñüñýñþòäòçòïòòòôòõòøòùòúóóóöôëôìôíôðôñôòôóôôô÷ôûõãõäõêõìõíõïõñõòõøõýöêöìöóöû÷â÷ê÷ì÷í÷î÷ð÷ò÷ø÷üøâøêøëøìøíøïøðøñøöø÷øüøþùàùèùíùîùðùóùüúþûáûäûæûçûèûêûóûöû÷ûøûÿüâüãüäüæüçüèüíüîüïüñüôüöü÷üøüùüÿýâýãýäýçýéýëýïýñýòýôýõýÿþàþáþâþãþåþçþéþìþíþïþòþõþöþ÷þùþþÿáÿâÿèÿéÿëÿïÿðÿøÿþÿÿ',
    18 => 'àààîàýáááâáãáäáåáæáçáêáìáíáñáòáõáöá÷áøáùáúáüáþáÿâáâââãâäâæâçâêâìâíâïâñâòâõâöâ÷âøâùâúâüâþãáãâãããäãçãèãêãëãìãíãñãòãóã÷ãøãÿäáäâäãäääæäçäêäëäìäíäïäðäñäòäóäõäöä÷äøäúäüäýäþäÿåóåýçáçãçäçåçæçççèçêçëçìçíçðçñçòçóçöç÷çøçúçüçýçþçÿêâêäêæêçêêêìêòêöê÷êøëáëâëãëäëæëêëëëìëíëïëñëòëôëõë÷ëøëùìáìâìãìêìëìììíìïìðìñìòìôìõìöì÷ìøìüìýìþìÿíáíâíãíäíæíçíêíëíííðíñíòíôíõíöí÷íøíùíüíýïêïìïíïïïñïòïôïöï÷ïøïûïüïÿðáðâðãðäðæðçðêðëðìðíðïðñðòðôðõðöð÷ðøðùñáñãñäñæñçñïñññôñõñöñøñùñúñüñýòáòâòãòäòçòêòëòìòïòñòòòôòõòöò÷òøòùòúòûòüòýòþóâóóôàôëôìôíôðôñôòôôô÷ôûõãõäõåõêõìõíõïõðõñõòõøõýöâöèöêöì÷â÷ê÷ë÷ì÷í÷î÷ð÷ò÷ø÷üøêøìøíøîøïøðøñøöø÷øüøþùíùîùðùóùüúþúÿûáûæûçûèûòûóûöûÿüâüãüæüçüíüîüïüöü÷üøüùýâýãýäýçýéýëýìýïýðýñýòýôýõýÿþáþâþãþäþåþæþçþéþíþïþñþòþõþöþ÷þùþþÿäÿåÿèÿëÿðÿ÷ÿþ',
    19 => 'àààáàâàãàåàæàèàêàìàîàïàóàôàõà÷àøàùàýàþàÿáâáãáäáçáìáòáõáøáùáþâáâââãâäâæâçâìâïâðâòâóâõâöâ÷âùâúâþãáãâãäãçãêãìãñãòã÷ãøãÿäáäãäïäõäöä÷äúäýåàåáåãåååæåèåêåëåíåîåïåóåôåöå÷åùåýåþåÿæâæãæìæïæðæöæþçáçãçæçççòçöçøçúçýçþçÿèàèáèâèãèåèæèèèéèìèîèïèóèôèõè÷èøèùèýèþèÿéãéåéçéëéîéïéðéôéõéöéøêäêæêçê÷êøëáëãëæëçëìëíëïëòëõë÷ëøëùìâìãìïìòìõìøìùìýìþíáíâíæíçíëíðíôíõí÷íùíýíþíÿîàîâîãîåîæîèîéîëîìîíîîîïîóîôîõîöî÷îøîùîýîþîÿïìïñïòïôïøðçðôðõðùñáñãñäñæñçñôñõñöñ÷ñøñùñúñýñþòãòäòçòìòïòôòõòöòøòùòúòýóàóáóâóãóäóåóæóçóèóéóêóíóîóïóðóñóòóóóôóõóöó÷óøóùóýóþóÿôàôìôíôîôðôñôòô÷ôûõäõðõýöàöâöìöîöóöû÷âøâøìøïøðøñøòøöøþùðùüýâýãýäýçýéýêýìýïýôýõýÿþàþáþâþãþäþåþæþçþéþêþëþìþíþïþðþõþöþ÷þøþþÿáÿãÿäÿåÿæÿèÿéÿêÿíÿïÿðÿòÿõÿöÿ÷ÿøÿùÿþÿÿ',
    20 => 'àààäàåàæàèàîàïàôàöà÷àùàýàþàÿåàåáåãåæåçåïåóåôåöå÷åùåýåþèâèæèóèôèõèùèýëáëâëãëäëæëçëêëëëìëíëñëòëôëõë÷ëøëùëûëüìáìâìãìèìêìëìììíìïìðìñìòìôìõìöì÷ìøìùìüìýìþìÿíàíáíâíãíäíåíæíçíèíêíëíííîíðíñíòíóíôíõíöí÷íøíùíüíýíþíÿîàîåîæîçîèîîîïîóîôîõîöî÷îøîùîýîþîÿðáðâðäðæðçðêðëðìðíðïðððñðòðôðõðöð÷ðøðùðüðþðÿñàñáñâñãñäñæñçñèñëñìñíñïñðñññóñôñõñöñ÷ñøñùñúñûñüñýñþñÿòáòâòãòäòçòêòëòìòíòïòðòñòòòôòõòöò÷òøòùòúòýòþóàóáóâóäóåóæóèóéóêóëóìóîóïóñóóóôóõó÷óøóùóýóÿôëôìôíôðôñôòôôô÷ôû÷à÷â÷å÷ê÷ë÷ì÷í÷î÷ð÷ò÷ó÷ø÷üûáûãûäûåûæûçûèûéûêûëûìûíûïûñûòûóûõûöû÷ûøûùûÿ',
    21 => 'àààãàçàôàöà÷àøàùâáâââãâäâåâæâçâèâêâëâìâíâïâðâñâòâóâõâöâ÷âøâùâúâûâüâþâÿãáãâãããäãåãçãèãêãëãìãíãðãñãòãóã÷ãøãÿäàäáäâäãäääåäæäçäèäêäëäìäïäðäñäòäóäõäöä÷äøäúäûäüäýäþäÿåàåáåãåäåååæåçåèåêåëåïåñåòåóåôåõåöå÷åùåýåþåÿèïèóèôèöèøèýêàêâêäêåêæêçêèêêêëêìêíêñêòêóêöê÷êøëáëâëãëäëæëçëêëëëìëíëïëñëòëôëõë÷ëøëùëüìáìâìãìêìëìíìïìðìñìòìôìõìöì÷ìøìùìüìýìþìÿíáíâíãíäíæíçíêíëíííðíñíòíôíõíöí÷íøíùíûíüíýîèîîîöîøîýîþîÿïåïèïêïëïìïíïïïñïòïóïôïöï÷ïøïûïüïÿðáðâðãðäðæðçðêðëðìðíðïðððñðòðôðõðöð÷ðøðùðûðÿñàñáñâñãñäñæñçñëñìñíñïñðñññóñôñõñöñ÷ñøñùñúñûñüñýñþòáòâòãòäòçòêòëòìòíòïòðòñòòòôòõòöò÷òøòùòúòüòýòþóáóâóãóçóèóéóìóíóîóñóóóôóõóöó÷óùóýóÿøàøâøêøëøìøíøïøðøñøòøóøöø÷øüøþýâýãýäýçýéýíýðýñýôýõýÿ',
    22 => 'àààáàâàãàäàæàçàèàéàêàîàñàóàôàöà÷àøàùàýâàâáâââãâäâæâçâêâëâìâíâîâïâðâñâòâóâõâöâ÷âøâùâúâûâüâþâÿåàåáåæåèåôåöå÷åøåùåýåÿèáèãèæèóèõèöè÷èøèùèýêâêäêæêçêêêëêìêíêðêñêòêöê÷êøìáìâìãìåìèìêìëìììíìîìïìðìñìòìóìôìõìöì÷ìøìùìûìüìýìþìÿîàîáîäîåîæîçîèîëîíîîîïîñîòîóîôîõîöî÷îøîùîýîþîÿóàóáóâóãóäóåóèóêóëóìóîóïóðóñóòóóóôóõóöó÷óøóùóýóÿûáûâûäûæûçûèûêûëûíûðûñûòûóûõûöû÷ûøûùûÿ',
    23 => 'àààáàçàîàïàóàôàöà÷àýâáâââãâäâæâçâèâêâëâìâíâïâðâñâòâõâöâ÷âøâùâúâüâþâÿåàåæåîåóåôåöåùåþèáèäèæèçèîèïèóèôèýêâêäêæêçêêêëêìêíêðêñêòêöê÷êøëáëâëãëäëæëçëêëëëìëíëïëñëòëóëôëõë÷ëøëùëûëüëþëÿìáìâìãìåìèìêìëìììíìïìðìñìòìóìôìõìöì÷ìøìùìüìýìþìÿíáíâíãíäíæíçíêíëíííðíñíòíôíõíöí÷íøíùíüíýíþîàîáîâîãîäîåîæîçîèîëîîîðîñîòîóîôîõîöîøîùîýîþîÿðàðáðâðãðäðæðçðèðêðëðìðíðîðïðððñðòðóðôðõðöð÷ðøðùðûðüðþðÿòáòâòãòäòçòêòëòìòíòïòðòñòòòôòõòöò÷òøòùòúòüòýòþóàóåóçóèóéóêóîóóóôóöó÷óýøâøêøëøìøíøîøïøðøñøòøöø÷øüøþüáüâüãüäüæüçüêüìüíüîüïüôüöü÷üøüù',
    24 => 'àààçàèàîàóàöàýâáâââãâäâæâçâêâëâìâíâîâïâðâñâòâóâõâöâ÷âøâùâúâüâþâÿåàåæåîåöåùåýèàèãèäèæèçèèèîèóèöè÷èýêäêæêçêêêëêìêíêðêñêòêöê÷êøëáëâëãëäëæëçëêëëëìëíëïëñëòëóëôëõë÷ëøëùëüìáìâìãìåìêìëìììíìîìïìðìñìòìóìôìõìöì÷ìøìùìüìýìþíáíâíãíäíæíçíêíëíííðíñíôíõíöí÷íøíùíüíýîàîäîæîçîèîîîõîöî÷îøîùîýîþîÿïåïêïëïìïíïïïñïòïóïôïöï÷ïøïûïüïÿðàðáðâðãðäðåðæðçðêðëðìðíðîðïðððñðòðôðõðöð÷ðøðùðûðüðþðÿñàñáñâñãñäñåñæñçñèñëñìñíñîñïñðñññòñóñôñõñöñ÷ñøñùñúñûñüñýñþñÿòáòâòãòäòçòêòëòìòíòïòñòòòôòõòöò÷òøòùòúòüòýòþòÿóâóãóäóæóçóèóêóíóîóïóóóôóõóöóýóÿöàöâöèöêöìöîöó÷â÷å÷è÷ê÷ë÷ì÷í÷î÷ð÷ò÷ó÷ø÷üüáüâüãüäüåüæüçüêüìüíüîüïüôüöü÷üøüùþàþáþâþãþäþåþæþçþéþêþëþìþíþïþñþõþöþ÷þøþùþþ',
    25 => 'àààáàæàçàèàîàïàðàóàôàöà÷àøàùàýåàåçåóåõåöåùåýåþåÿèàèáèãèäèæèçèèèîèðèñèóèôèýèþèÿíáíâíãíäíæíçíêíëíííðíñíòíôíõíöí÷íøíùíüíýíþíÿîàîâîäîåîæîçîèîéîêîëîíîîîïîðîñîòîóîôîõîöî÷îøîùîýîþîÿðàðáðâðãðäðæðçðêðëðìðíðîðïðððñðòðóðôðõðöð÷ðøðùðûðüðþóàóáóâóãóäóåóæóçóèóéóêóëóìóîóóóôóõóöó÷óøóýóÿüáüâüãüäüåüæüçüèüêüìüíüîüïüñüòüôüöü÷üøüùüÿ',
    26 => 'åàåáåâåãåååèåéåíåîåïåòåóåôåöå÷åùåýåþåÿþàþáþâþãþäþåþæþçþéþêþëþìþïþðþñþõþöþ÷þøþùþþÿáÿãÿäÿåÿæÿèÿéÿêÿìÿïÿõÿöÿ÷ÿøÿùÿþÿÿ',
    27 => 'áááâáãáäáæáçáìáñáòáõáöá÷áøáùáúáþáÿâáâââãâäâæâçâëâìâïâðâñâòâõâöâùâúâüâþâÿãáãâãããäãåãçãêãìãñãòãóã÷ãøäáäãäääæäçäêäìäïäñäòäõäöä÷äøäúäûäüäýäþäÿåàåáåâåãåååæåèåéåêåëåíåîåïåðåñåòåóåôåöå÷åøåùåýåþåÿæáæâæëæìæïæðæñæóæöæ÷æüæþçáçäçæçççèçêçìçðçñçöç÷çøçúçüçýçþçÿèàèáèâèäèåèæèçèèèéèêèëèìèíèîèïèðèòèóèôèõèöè÷èøèùèýèþèÿéâéãéåéçéêéëéìéíéîéðéñéôéõéöé÷éøêäêæêçêêêìêñêòêöê÷ëáëâëãëæëçëëëìëíëïëòëôëõë÷ëøëùëþìâìãìëìììíìðìòìôìõìöìøìùìüìýìþíáíâíãíäíæíçíëíðíòíôíõíöíøíùíýïìïïïñïòïôïöïøïûðáðãðäðæðçðëðìðïðððñðòðôðõðöð÷ðùñáñãñäñæñçñíñðñññôñöñùñúñýñþòáòãòäòçòìòïòòòôòõòöò÷òøòùòúòýòþóàóáóâóãóåóçóèóéóêóëóìóíóîóïóðóñóòóóóôóõóöóøóùóýóþóÿõãõäõêõìõïõðõñõóõøõýöèöêöìöîöóöû÷â÷ì÷ð÷ò÷ø÷üøìøïøðøñøòø÷øþùàùíùîùðùüÿáÿãÿäÿåÿæÿçÿèÿéÿêÿëÿìÿíÿïÿðÿòÿõÿöÿ÷ÿøÿùÿþÿÿ',
    28 => 'áááâáãáäáæáçáêáëáìáíáðáñáòáõáöá÷áøáùáúáüáþáÿâáâââãâäâæâçâêâëâìâíâïâðâñâòâóâõâöâ÷âøâùâúâüâþâÿãáãâãããäãçãêãëãìãíãðãñãòã÷ãøãÿäáäâäãäääæäçäèäêäëäìäíäïäðäòäóäõäöä÷äúäûäüäýäþäÿåàåáåååæåèåëåíåîåóåõåöå÷åùåýåþåÿæáæâæãæäæææèæêæëæìæíæîæïæðæñæóæöæ÷æüæþçáçãçäçæçççëçìçðçñçòçöç÷çøçúçýçþèàèáèâèãèäèåèæèçèèèéèêèëèíèîèïèñèòèóèôè÷èùèýèþèÿêâêäêæêçêêêìêðêòêöê÷êøìáìâìãìêìëìììíìïìðìñìòìôìõìöì÷ìøìùìüìýìþíáíâíãíäíæíçíêíëíííðíñíòíôíõíöí÷íøíùíüíýîàîáîâîãîäîåîæîçîèîéîêîëîìîîîïîñîóîôîõîöî÷îøîùîýîþîÿïêïëïìïíïîïïïðïñïóïôïöï÷ïøïûïüïÿñâñãñäñåñæñçñëñìñíñïñðñññôñõñöñ÷ñøñùñúñüñýñþòáòâòãòäòçòêòëòìòïòñòòòôòõòöò÷òøòùòúòüòýòþòÿôåôëôìôíôñôòôôô÷öâöêöì÷â÷ê÷ë÷ì÷í÷ð÷ò÷ø÷üøâøêøëøìøíøïøðøñøòøöø÷øüøþùíùîùðùüþàþáþâþãþäþåþæþéþëþìþíþïþðþõþöþ÷þøþþÿáÿäÿåÿæÿçÿèÿéÿëÿïÿñÿòÿöÿ÷ÿøÿùÿÿ',
    29 => 'âáâââãâäâæâçâêâëâíâïâñâòâóâõâöâ÷âøâùâúâûâüâþâÿãàãáãâãããäãçãèãêãëãìãíãðãñãòãóã÷ãøãÿäáäæäçäêäëäíäîäïäðäñäòäóäõäöä÷äøäúäûäüäýäþäÿçàçáçâçãçäçæçççêçëçìçíçðçñçòçóçöç÷çøçúçûçüçýçþçÿéâéãéäéåéçéêéìéîéïéðéòéõéöé÷éøêäêåêæêêêëêìêíêòêöê÷êøëáëâëãëäëæëçëêëíëîëïëñëòëôëõë÷ëøëùëûëþëÿìâìãìêìëìíìðìñìòìôìõìöì÷ìøìùìûìüìýìþìÿíàíáíæíçíêíëíðíóíôíõí÷íøíùíûíüíýíþíÿïàïåïêïëïìïíïðïñïòïóïôïöï÷ïøïûïüïÿðáðãðäðæðêðìðïðððôðõðöð÷ðøðùðüðþðÿñàñáñâñãñäñåñæñçñèñëñìñíñîñïñðñññóñôñöñ÷ñøñùñúñûñüñýñþñÿòáòâòãòäòçòëòìòïòñòòòôòõòöò÷òøòùòúòüòýòþòÿôàôëôìôíôîôðôñôòôóô÷ôûõâõãõäõåõèõêõëõìõïõðõñõòõóõøõýÿáÿâÿãÿäÿåÿæÿçÿèÿéÿëÿìÿíÿïÿðÿñÿòÿõÿöÿ÷ÿøÿùÿþÿÿ',
    30 => 'àààáàâàãàäàåàæàçàèàéàêàëàìàîàïàñàòàóàôàõàöà÷àøàùàýàþàÿáááãáäáæáçáìáðáñáòáõáöá÷áøáùáúáüáþâàâáâââãâäâæâçâêâëâìâíâïâðâñâòâóâõâöâ÷âøâùâúâüâþâÿãáãâãããäãçãèãêãëãìãíãðãñãòãóã÷ãøãÿäáäâäãäääçäêäëäìäïäðäòäõä÷äøäúäûäýäþåàåáåâåãåäåååæåçåèåéåêåëåíåîåïåðåñåóåôåõåöå÷åøåùåýåþåÿæáæâæãæäæææêæëæìæîæïæðæñæóæöæ÷æüæþçáçâçäçççêçëçìçðçñçòçöç÷çøçúçüçýçþçÿéâéãéäéåéçéêéëéíéîéïéðéñéòéôéõéöé÷éøêäêæêçêêêëêìêðêòêöê÷êøëàëáëâëãëäëæëçëêëìëíëîëïëñëòëóëôëõë÷ëøëùëûìáìâìãìëìììíìïìðìñìòìóìôìõìöì÷ìøìùìüìýìþìÿíáíâíäíæíçíëíííðíñíòíôí÷íøíùíýíþïàïëïìïíïîïïïðïñïòïóïôïöï÷ïøïûïüïÿðáðâðãðäðæðçðëðìðððñðòðôðõðöð÷ðøðùðþñáñâñãñäñæñçñëñìñíñïñðñññóñôñõñöñ÷ñøñùñúñýòáòâòãòäòçòëòìòïòðòòòôòõòöò÷òøòùòúòüòýòþòÿõâõãõäõêõëõìõïõðõñõòõøõýöàöâöåöêöìöîöóöû÷â÷ë÷ì÷ð÷ò÷øøâøåøèøëøìøîøïøðøñøòøöø÷øüøþùíùîùðùüþàþáþâþãþäþåþæþçþéþêþëþìþíþïþðþñþõþöþ÷þøþùþþ',
    31 => 'áááâáãáäáåáæáçáêáìáíáñáòáóáõáöá÷áøáùáúáûáþáÿâáâââãâäâæâçâìâïâðâòâõâöâ÷âùâúâþãáãâãããäãçãìãðãòãøãÿäáäâäãäääæäçäëäìäïäñäòäõäöäøäúäýåàåáåãåååæåçåèåéåëåíåîåïåðåñåóåôåõåöå÷åùåýåþåÿæâæãæäæææëæìæîæïæðæñæöæ÷æüæþçáçäçæçççìçðçñçòçöçøçúçýçþèàèáèâèãèäèåèæèèèéèêèëèìèîèïèðèñèòèóèôèõèøèùèýèþèÿéâéãéäéåéçéëéìéíéîéïéðéôéõé÷éøêâêäêæêçêêêìêðêòêöê÷ëáëâëãëäëåëæëçëëëìëíëïëôëõë÷ëøëùëÿìâìãìììíìðìòìôìõì÷ìøìýìþìÿíáíæíçíëíðíòíôíõíøíýïëïìïïïðïñïòïôïöïøïüïÿðáðâðãðæðçðïðððòðôðõðöðøðùðüðþðÿñáñâñãñäñæñçñìñïñðñññôñõñöñ÷ñøñùñúñýñþòáòãòäòçòëòìòïòðòòòôòõòöò÷òøòùòúòýòþòÿõâõãõäõåõêõìõîõðõñõóõøõýöâöìöîöó÷â÷ë÷ì÷ð÷ò÷øøàøâøìøîøïøðøñøòøóøöø÷øüøþùîùðùüþàþáþâþãþäþåþæþçþéþêþëþìþíþïþðþõþöþ÷þøþþÿáÿâÿãÿäÿåÿæÿçÿèÿéÿêÿëÿíÿïÿðÿòÿõÿöÿ÷ÿøÿùÿþÿÿ',
    );
  $res=0;
  for($i=0;$i<strlen($s)-1;$i++)
  {
    $c1=$s[$i];
    if($c1<'à'||$c1>'ÿ') continue;
    $c2=$s[$i+1];
    if($c2<'à'||$c2>'ÿ') continue;
    $i1=ord($c1)-ord('à');
    if(strpos($a[$i1],$c2)!==false)
    {
      $res++;
      continue;
    }
    if($i>=strlen($s)-2) continue;
    $c3=$s[$i+2];
    if($c3<'à'||$c3>'ÿ') continue;
    $i2=ord($c2)-ord('à');
    if(strpos($a[$i2],$c3)!==false)
    {
      $res++;
      $i++;
      continue;
    }
    $l=0;
    $r=strlen($b[$i1])/2-1;
    while($l<=$r)
    {
      $c=$l+(($r-$l)>>1);
      $ca=$b[$i1][$c*2];
      $cb=$b[$i1][$c*2+1];
      if($ca==$c2&&$cb==$c3)
      {
        $res++;
        break;
      }
      if($ca<$c2||$ca==$c2&&$cb<$c3)
        $l=$c+1;
      else
        $r=$c-1;
    }
  }
  return $res;
}

function _charset_alt_win($s)
{
  for($i=0;$i<strlen($s);$i++)
  {
    $c=ord($s[$i]);
    if($c>=0x80&&$c<=0x9f)
      $s[$i]=chr($c-0x80+0xc0);
    else if($c>=0xa0&&$c<=0xaf)
      $s[$i]=chr($c-0xa0+0xe0);
    else if($c>=0xc0&&$c<=0xdf)
      $s[$i]=chr($c-0xc0+0x80);
    else if($c>=0xf0&&$c<=0xff)
      $s[$i]=chr($c-0xf0+0xa0);
  }
  return $s;
}

function _charset_koi_win($s)
{
  $kw = array(
    //00   01   02   03   04   05   06   07   08   09   0a    0b   0c    0d   0e   0f
    0x80, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138,  139, 140,  141, 142, 143, //0x80 - 0x8f
     144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 0xbb, 156, 0xab, 158, 159, //0x90 - 0x9f
     160, 161, 162, 184, 164, 165, 166, 167, 168, 169, 170,  171, 172,  173, 174, 175, //0xa0 - 0xaf
     176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186,  187, 188,  189, 190, 191, //0xb0 - 0xbf
     254, 224, 225, 246, 228, 229, 244, 227, 245, 232, 233,  234, 235,  236, 237, 238, //0xc0 - 0xcf
     239, 255, 240, 241, 242, 243, 230, 226, 252, 251, 231,  248, 253,  249, 247, 250, //0xd0 - 0xdf
     222, 192, 193, 214, 196, 197, 212, 195, 213, 200, 201,  202, 203,  204, 205, 206, //0xe0 - 0xef
     207, 223, 208, 209, 210, 211, 198, 194, 220, 219, 199,  216, 221,  217, 215, 218  //0xf0 - 0xff
     );
  for($i=0;$i<strlen($s);$i++)
  {
    $c=ord($s[$i]);
    if($c>=128)
      $s[$i]=chr($kw[$c-128]);
  }
  return $s;
}

function _charset_utf8_win($s)
{
  $r='';
  $state=1;
  for ($i=0;$i<strlen($s);$i++)
  {
    $c=ord($s[$i]);
    switch($state)
    {
      case 1: //not a special symbol
        if($c<=127)
        {
          $r.=$s[$i];
        }
        else
        {
          if(($c>>5)==6)
          {
            $c1=$c;
            $state=2;
          }
          else
            $r.=chr(128);
        }
        break;
      case 2: //an utf-8 encoded symbol has been meet
        $new_c2=($c1&3)*64+($c&63);
        $new_c1=($c1>>2)&5;
        $new_i=$new_c1*256+$new_c2;
        switch($new_i)
        {
          case   1025: $out_c='¨'; break;
          case   1105: $out_c='¸'; break;
          case 0x00ab: $out_c='«'; break;
          case 0x00bb: $out_c='»'; break;
          default: $out_c=chr($new_i-848);
        }
        $r.=$out_c;
        $state=1;
        break;
    }
  }
  return $r;
}

function _charset_prepare($s)
{
  $r=0;
  $k=0;
  for($i=0;$i<strlen($s)&&$r<255;$i++)
  {
    $c=ord($s[$i]);
    if($c>=0x80)
    {
      $r++;
      $k=$i;
    }
  }
  return substr($s,0,$k+1);
}

function charset_win_lowercase($s)
{
  for($i=0;$i<strlen($s);$i++)
  {
    $c=ord($s[$i]);
    if($c>=0xc0&&$c<=0xdf)
      $s[$i]=chr($c+32);
    else if($s[$i]>='A'&&$s[$i]<='Z')
      $s[$i]=chr($c+32);
  }
  return $s;
}

function charset_x_win($s)
{
// returns a string converted from a best encoding (windows-1251 or koi-8r) to windows-1251
  $sa=_charset_prepare($s);
  $s1=charset_win_lowercase($sa);
  $r1='windows-1251';

  $c1=_charset_count_chars($s1);
  $b1=_charset_count_bad($s1);
  $p1=_charset_count_pairs($s1);
  $w1=$p1*32+$b1*64-$c1;

  $s2=charset_win_lowercase(_charset_koi_win($sa));
  $w2=-$c1; //Îñîáåííîñòü êîäèðîâêè koi-8r: òîò æå äèàïàçîí ñèìâîëîâ, ÷òî è äëÿ windows-1251
  if($w2<$w1)
  {
    $b2=_charset_count_bad($s2);
    $w2+=64*$b2;
    if($w2<$w1)
    {
      $p2=_charset_count_pairs($s2);
      $w2+=32*$p2;
      if($w2<$w1)
      {
        $r1='koi-8r';
        $w1=$w2;
      }
    }
  }

  $s2=charset_win_lowercase(_charset_utf8_win($sa));

  $c2=_charset_count_chars($s2);
  $w2=-$c2;
  if($w2<$w1)
  {
    $b2=_charset_count_bad($s2);
    $w2+=64*$b2;
    if($w2<$w1)
    {
      $p2=_charset_count_pairs($s2);
      $w2+=32*$p2;
      if($w2<$w1)
      {
        $r1='utf';
        $w1=$w2;
      }
    }
  }

  switch($r1)
  {
    case 'alt':
      return _charset_alt_win($s);
    case 'koi-8r':
      return _charset_koi_win($s);
    case 'utf':
      return _charset_utf8_win($s);
    default:
      return $s;
  }

  return $s;
}


?>